language:zh-CN
特性: 测试滑动
    场景: swipe滑动
        手指向左滑动屏幕
        手指向右滑动屏幕
        手指向上滑动屏幕
        手指向下滑动屏幕
        
        手指以步长【100】向左滑动屏幕
        手指以步长【100】向右滑动屏幕
        手指以步长【100】向上滑动屏幕
        手指以步长【100】向下滑动屏幕
        
        手指从坐标【100,200】滑动至坐标【600,700】
        手指以步长【100】从坐标【100,200】滑动至坐标【600,700】
        
        以页面元素【text=Gallery】为起点，手指向左滑动
        以页面元素【text=Gallery】为起点，手指向右滑动
        以页面元素【text=Gallery】为起点，手指向上滑动
        以页面元素【text=Gallery】为起点，手指向下滑动
        
        以页面元素【text=Gallery】为起点，步长为【100】手指向左滑动
        以页面元素【text=Gallery】为起点，步长为【100】手指向右滑动
        以页面元素【text=Gallery】为起点，步长为【100】手指向上滑动
        以页面元素【text=Gallery】为起点，步长为【100】手指向下滑动
        
        以页面元素【className=android.widget.TextView,text=HiBeam】为起点，步长为【100】手指向左滑动
        以页面元素【className=android.widget.TextView】为起点，步长为【100】手指向右滑动
        以页面元素【className=android.widget.TextView】为起点，步长为【100】手指向上滑动
        以页面元素【className=android.widget.TextView】为起点，步长为【100】手指向下滑动
        
    场景: drag拖动
        从坐标【100,200】拖动至坐标【700,800】
        以步长【100】从坐标【100,200】拖动至坐标【700,800】
        拖动页面元素【text=Gallery】至坐标【700,800】
        以步长【100】拖动页面元素【text=Gallery】至坐标【700,800】
        拖动页面元素【text=Gallery】至页面元素【text=HiBeam】
        
    场景: fling快速滑动
        手指快速向左滑动屏幕
        手指快速向右滑动屏幕
        手指快速向上滑动屏幕
        手指快速向下滑动屏幕
        手指快速向左边起始位置滑动
        手指快速向右边末尾位置滑动
        手指快速向上边起始位置滑动
        手指快速向下边末尾位置滑动
        
    场景: scroll滚动
        手指向左滚动屏幕
        手指向右滚动屏幕
        手指向上滚动屏幕
        手指向下滚动屏幕
        
        以步长【100】手指左滚动
        以步长【100】手指右滚动
        以步长【100】手指上滚动
        以步长【100】手指下滚动
        
        手指向左边起始位置滚动
        手指向右边末尾位置滚动
        手指向上边起始位置滚动
        手指向下边末尾位置滚动
        
        手指纵向滚动至页面元素【text=Printing】
        手指横向滚动至页面元素【text=Apps】